#Conte√∫do extra

#Importando html

In [1]:
import pandas as pd

https://www.federalreserve.gov/releases/h3/current/default.htm

In [ ]:
df_html = pd.read_html('https://www.federalreserve.gov/releases/h3/current/default.htm')

In [ ]:
len(df_html)

3

In [ ]:
df_html[0].head()

         Date  ...                                       Reserve balances maintained 4
         Date  ... Balances maintained that exceed the top of the penalty- free band 6
0     Month 7  ...                                            Month 7
1   Aug. 2019  ...                                            1373321
2  Sept. 2019  ...                                            1292273
3   Oct. 2019  ...                                            1333462
4   Nov. 2019  ...                                            1375085

[5 rows x 7 columns]

In [ ]:
df_html[1].head()

         Date Reserves  ...               Monetary base
         Date  Total 1  ... Total balances maintained 6 Currency in circulation
0     Month 7  Month 7  ...                     Month 7                 Month 7
1   Aug. 2019  1586844  ...                     1520876                 1750502
2  Sept. 2019  1504805  ...                     1439771                 1762898
3   Oct. 2019  1547136  ...                     1481513                 1771294
4   Nov. 2019  1595222  ...                     1529341                 1786209

[5 rows x 9 columns]

In [ ]:
df_html[2].head()

         Date  ... Nonborrowed reserves 2
         Date  ... Nonborrowed reserves 2
0     Month 3  ...                Month 3
1   Aug. 2019  ...                1586727
2  Sept. 2019  ...                1504704
3   Oct. 2019  ...                1547073
4   Nov. 2019  ...                1595196

[5 rows x 7 columns]

In [ ]:
data = [1 , 2, 3, 4 ,5]
s = pd.Series(data)

In [ ]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
index = ['Linha' + str(i) for i in range(5)]

In [ ]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [ ]:
s = pd.Series(data= data, index=index)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [ ]:
data = {'linha' + str(i) : i +1 for i in range(5)}
data

{'linha0': 1, 'linha1': 2, 'linha2': 3, 'linha3': 4, 'linha4': 5}

In [ ]:
s = pd.Series(data)
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [ ]:
s1 = s+1
s1

linha0    2
linha1    3
linha2    4
linha3    5
linha4    6
dtype: int64

In [ ]:
s2 = s + s1
s2

linha0     3
linha1     5
linha2     7
linha3     9
linha4    11
dtype: int64

##DataFrame

In [ ]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [ ]:
df1 = pd.DataFrame(data= data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
index = ['linha' + str(i) for i in range(3)]

In [ ]:
df1 = pd.DataFrame(data=data, index=index)
df1

        0  1  2
linha0  1  2  3
linha1  4  5  6
linha2  7  8  9

In [ ]:
columns = ['coluna' + str(i) for i in range(3)]

In [ ]:
df1 = pd.DataFrame(data=data, index=index, columns=columns)
df1

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [ ]:
data = {'coluna0': {'linha0': 1, 'linha1': 4, 'linha2': 7},
        'coluna1': {'linha0': 2, 'linha1': 5, 'linha2': 8},
        'coluna2': {'linha0': 3, 'linha1': 6, 'linha2': 9}
}

In [ ]:
data

{'coluna0': {'linha0': 1, 'linha1': 4, 'linha2': 7},
 'coluna1': {'linha0': 2, 'linha1': 5, 'linha2': 8},
 'coluna2': {'linha0': 3, 'linha1': 6, 'linha2': 9}}

In [ ]:
df2 = pd.DataFrame(data=data)
df2

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [ ]:
data = [(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [ ]:
df3 = pd.DataFrame(data=data, index=index, columns=columns)
df3

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [ ]:
df1[df1 > 0] = 'A'
df1

       coluna0 coluna1 coluna2
linha0       A       A       A
linha1       A       A       A
linha2       A       A       A

In [ ]:
df2[df2 > 0] = 'B'
df2

       coluna0 coluna1 coluna2
linha0       B       B       B
linha1       B       B       B
linha2       B       B       B

In [ ]:
df3[df3 > 0] = 'C'
df3

       coluna0 coluna1 coluna2
linha0       C       C       C
linha1       C       C       C
linha2       C       C       C

In [ ]:
df4 = pd.concat([df1, df2, df3])
df4

       coluna0 coluna1 coluna2
linha0       A       A       A
linha1       A       A       A
linha2       A       A       A
linha0       B       B       B
linha1       B       B       B
linha2       B       B       B
linha0       C       C       C
linha1       C       C       C
linha2       C       C       C

In [ ]:
df4 = pd.concat([df1, df2, df3], axis=1)
df4

       coluna0 coluna1 coluna2 coluna0 coluna1 coluna2 coluna0 coluna1 coluna2
linha0       A       A       A       B       B       B       C       C       C
linha1       A       A       A       B       B       B       C       C       C
linha2       A       A       A       B       B       B       C       C       C

##Organizando Dataframe

In [2]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [3]:
list('321')

['3', '2', '1']

In [5]:
df = pd.DataFrame(data, list('321'),  list('zyx'))
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

In [7]:
df.sort_index(inplace=True)
df

   z  y  x
1  7  8  9
2  4  5  6
3  1  2  3

In [8]:
df.sort_index(inplace=True, axis=1)
df

   x  y  z
1  9  8  7
2  6  5  4
3  3  2  1

In [10]:
df.sort_values(by='x', inplace=True)
df

   x  y  z
3  3  2  1
2  6  5  4
1  9  8  7

In [11]:
df.sort_values(by='3', axis=1, inplace=True)
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

In [13]:
df.sort_values(by=['x', 'y'], inplace=True)
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

#Formas de sele√ß√£o

In [14]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (9, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [15]:
df['c1']

l1     1
l2     5
l3     9
l4    13
Name: c1, dtype: int64

In [17]:
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   9
l4  15  13

In [21]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12

In [22]:
df[1:3][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   9

In [23]:
df.loc['l3']

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [24]:
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   9  10  11  12
l2   5   6   7   8

In [25]:
df.loc['l1', 'c2']

2

In [26]:
df.iloc[0 , 1]

2

In [27]:
df.loc[['l3', 'l1'], ['c4', 'c1']]

    c4  c1
l3  12   9
l1   4   1

In [28]:
df.iloc[[2, 0], [3,  0]]

    c4  c1
l3  12   9
l1   4   1